Repository: Rushin2211/XDAG-Pro
Catalog: lib/l10n/app_*.arb
Languages: it

source: Create Wallet
it: Crea portafoglio

source: Import Wallet
it: Importa portafoglio

# welcomeTitle_1
source: Private and Secure
it: Privato e sicuro

# welcomeDesc_1
source: Only keep the private keys on your device
it: Mantieni le chiavi private solo sul tuo dispositivo

# welcomeTitle_2
source: Manage assets
it: Gestisci asset

# welcomeDesc_2
source: Easy to receive and send assets
it: Facile per ricevere e inviare asset

# welcomeTitle_3
source: Full platform support
it: Supporto completo alla piattaforma

# welcomeDesc_3
source: Works on different devices
it: Funziona su diversi dispositivi

source: Select Language
it: Seleziona Lingua

# create_password_tips
source: Before starting to use it, you need to set a secret code to ensure your security.
it: Prima di iniziare ad usarlo, devi impostare un codice segreto per garantire la tua sicurezza.

# create_faceid_tips
source: To enhance the security of your account, please enable the biometric authentication feature on your device before using the wallet app.
it: Per migliorare la sicurezza del tuo account, abilita la funzione di autenticazione biometrica sul tuo dispositivo prima di utilizzare l'app del portafoglio.

# create_password
source: Create secret code
it: Crea codice segreto

# repeat_password
source: Repeat secret code
it: Ripeti codice segreto

source: Security
it: Sicurezza

source: Wallet Name
it: Nome del portafoglio

# createWalletTips
source: I understand that XDAG-Pro can't recover my secret code
it: Ho capito che XDAG-Pro non può recuperare il mio codice segreto

# continueText
source: Continue
it: Continua

source: Mnemonic
it: Mnemonico

source: Private Key
it: Chiave privata

source: Skip for now
it: Salta per ora

# create_biometrics_tips_1
source: Press here enable Face ID
it: Premi qui per abilitare Face ID

# create_biometrics_tips_2
source: Press here enable Touch ID
it: Premi qui per abilitare Touch ID

# create_biometrics_tips_3
source: Press here enable Biometrics
it: Premi qui per abilitare la biometria

source: Attention
it: Attenzione

# reset_password_tips
source: Although you have created a secret code in the previous operation, you can reset it at any time before importing or creating a wallet.
it: Anche se hai creato un codice segreto nella precedente operazione, puoi reimpostarlo in qualsiasi momento prima di importare o creare un portafoglio.

# reset_password
source: Reset secret code
it: Reimposta codice segreto

source: Language
it: Lingua

source: Legal documents
it: Documenti legali

source: About us
it: Chi siamo

# setting
source: Settings
it: Impostazioni

source: Wallet
it: Portafoglio

source: Privacy Policy
it: Informativa sulla privacy

source: Terms of Use
it: Termini di utilizzo

source: Select Wallet
it: Seleziona portafoglio

source: Send
it: Invia

source: Receive
it: Ricevi

source: Copied to clipboard
it: Copiato negli appunti

# show_QR
source: Show QR code to receive XDAG
it: Mostra il codice QR per ricevere XDAG

source: Share wallet address
it: Condividi indirizzo del portafoglio

source: Copy
it: Copia

source: Share
it: Condividi

source: Wallet Details
it: Dettagli del portafoglio

source: Delete Wallet
it: Elimina portafoglio

# enter_password
source: Enter secret code
it: Inserisci il codice segreto

# use_biometrics_tips_1
source: Press here use Face ID
it: Premi qui per usare Face ID

# use_biometrics_tips_2
source: Press here use Touch ID
it: Premi qui per usare Touch ID

# use_biometrics_tips_3
source: Press here use Biometrics
it: Premi qui per usare Biometrics

# use_password
source: Use secret code
it: Usa codice segreto

# use_biometrics_1
source: Use Face ID
it: Usa Face ID

# use_biometrics_2
source: Use Touch ID
it: Usa Touch ID

# use_biometrics_3
source: Use Biometrics
it: Usa Biometrics

# delete_tip
source: If you delete your wallet without backing it up, you will lose all your digital assets permanently and they cannot be recovered.
it: Se elimini il tuo portafoglio senza effettuare il backup, perderai tutti i tuoi asset digitali in modo permanente e non sarà possibile recuperarli.

source: Write Down Mnemonics
it: Scrivi Mnemonici

source: Write Down Private Key
it: Scrivi la chiave privata

# write_Down_Mnemonics_tips
source: Please store the mnemonics in a safe place, preferably on a device without internet access or on paper.
it: Si prega di conservare i mnemonici in un luogo sicuro, preferibilmente su un dispositivo senza accesso a Internet o su carta.

# write_Down_PrivateKey_tips
source: Please store the private key in a safe place, preferably on a device without internet access or on paper.
it: Si prega di conservare la chiave privata in un luogo sicuro, preferibilmente su un dispositivo senza accesso a Internet o su carta.

source: change wallet name
it: Cambia nome del portafoglio

# change_password
source: Change secret code
it: Cambia codice segreto

# change_password_success
source: Change secret code successfully
it: Cambiamento del codice segreto effettuato con successo

# enable_biometrics_1
source: Enable Face ID
it: Abilita Face ID

# enable_biometrics_2
source: Enable Touch ID
it: Abilita Touch ID

# enable_biometrics_3
source: Enable Biometrics
it: Abilita Biometrics

# disenable_biometrics_1
source: Disenable Face ID
it: Disabilita Face ID

# disenable_biometrics_2
source: Disenable Touch ID
it: Disabilita Touch ID

# disenable_biometrics_3
source: Disenable Biometrics
it: Disabilita Biometrics

# no_transactions
source: Any transaction
it: Nessuna transazione

# send_on
source: Sent on
it: Inviato il

# receive_on
source: Received on
it: Ricevuto il

source: Receiver
it: Destinatario

source: Sender
it: Mittente

source: Fee
it: Commissioni

source: Cancel
it: Annulla

# verify_protect_wallet
source: Please verify to protect your wallet
it: Verifica per proteggere il portafoglio

# review_Privacy_Policy
source: Please review XDAG-Pro Privacy Policy and Terms of Service.
it: Si prega di esaminare la Privacy Policy e i Termini di Servizio di XDAG-Pro.

# accepted_Privacy_Policy
source: I have read and accept the Privacy Policy and Terms of Service.
it: Ho letto ed accetto la Privacy Policy e i Termini di Servizio.

source: Wallet address
it: Indirizzo del portafoglio

source: To
it: A

source: Amount
it: Importo

source: All
it: Tutto

# send_Success
source: Send successfully
it: Invio riuscito

source: Block address
it: Indirizzo del blocco

source: State
it: Stato

source: Pending
it: In attesa

source: Remark
it: Nota

source: Wallet address error
it: Errore nell'indirizzo del portafoglio

source: Error
it: Errore

# camera_permissions
source: Please turn on the camera permissions
it: Si prega di attivare le autorizzazioni della fotocamera

# qr_not_found
source: QR-code not found
it: QR-code non trovato

# backup_your_wallet
source: You need to backup your wallet.
it: Devi eseguire il backup del tuo portafoglio.

# backup_test_tips_1
source: Please store the mnemonics in a safe place, preferably on a device without internet access or on paper.
it: Si prega di conservare le mnemoniche in un luogo sicuro, preferibilmente su un dispositivo senza accesso a internet o su carta.

# backup_test_tips_2
source: When you wish to use the wallet on a new device, this is the only way that the mnemonics can be recovered from your wallet.
it: Quando si desidera utilizzare il portafoglio su un nuovo dispositivo, questo è l'unico modo per recuperare le mnemoniche dal portafoglio.

# backup_test_tips_3
source: Please note down your mnemonics and in the next step you will be asked to re-enter them.
it: Si prega di annotare le mnemoniche e nel passaggio successivo verrà chiesto di inserirle di nuovo.

# confirm_Mnemonic
source: Confirm Mnemonics
it: Conferma le mnemoniche

source: Successful
it: Riuscito

# backup_test_tips_4
source: You have passed the wallet protection test, please remember that helper words must be saved.
it: Hai superato il test di protezione del portafoglio, per favore ricorda che le parole d'aiuto devono essere salvate.

# backup_test_tips_5
source: If you lose it, XDAG-Pro cannot recover your wallet.
it: Se le perdi, XDAG-Pro non può recuperare il tuo portafoglio.

# secure_wallet
source: Secure Your Wallet
it: Proteggi il tuo portafoglio

source: Start
it: Inizia

source: Next
it: Avanti

# mnemonic_hint_1
source: When entering your mnemonic phrase, please separate each word with a space.
it: Quando inserisci la tua frase mnemonica, separa ogni parola con uno spazio.

# mnemonic_hint_2
source: Please enter the mnemonic phrase you just recorded in the blank space below, separating each word with a space.
it: Si prega di inserire la frase mnemonica appena registrata nel campo vuoto sottostante, separando ogni parola con uno spazio.

source: word
it: parola

source: words
it: parole

source: Mnemonic error
it: Errore mnemonico

# mnemonic_error_1
source: Mnemonic mismatch
it: Disallineamento mnemonico

source: Network
it: Rete

source: Select Network
it: Seleziona la rete

source: Contacts
it: Contatti

source: Contact Name
it: Nome del contatto

source: Add Contact
it: Aggiungi contatto

source: Edit Contact
it: Modifica contatto

# delete_contact
source: Do you confirm to delete this contact ?
it: Confermi di eliminare questo contatto?

# contact_name_error
source: Contact name only supports letters, numbers, and spaces
it: Il nome del contatto supporta solo lettere, numeri e spazi

# contact_tips
source: Please note that contacts are only stored locally on this device. If you delete the app, your contacts will be permanently lost and cannot be recovered.
it: Si prega di notare che i contatti sono conservati solo localmente su questo dispositivo. Se si elimina l'app, i contatti verranno persi in modo permanente e non saranno recuperabili.

# no_contacts
source: Any contact
it: Nessun contatto

source: Tips
it: Suggerimenti

# wallet_tips
source: Swipe the item to the right to delete the wallet.
it: Scorri l'elemento verso destra per eliminare il portafoglio
